<!DOCTYPE HTML>
<HTML lang="es">
<head>
 <meta charset="utf-8">
 <meta name="description" content="2010-2020">
 <meta name="viewport" content="width=device-width, initial-scale=1.0">
 <link rel="Stylesheet" type="text/css" href="estilo.css">
 <title>Pagina 4</title>
</head>
  
<body>
   
<div class="contenedor">
  
<header>
<h1>2010-2020: Web 3.0 y 4.0</h1>
</header>

<nav>
    <ul>
        <li><a href="index.html">Inicio</a></li>

        <li><a href="Fundamentos de computacion e internet.html">
            1945-1989 Fundamentos de computacion e internet
        </a></li>

        <li><a href="web1.html">
            1990-2000 Nacimiento de la Web 1.0
        </a></li>

        <li><a href="Tokyo.html">
            2000-2010 Web 2.0. Web social e interactiva
        </a></li>

        <li><a href="WEB5.html">
            2022-Actualidad Web 5.0
        </a></li>
    </ul>
</nav>

<section>

<div class="info">

<p>Entre 2010 y 2020 la Web se volvi&oacute; m&aacute;s inteligente, m&oacute;vil y personalizada. 
En este periodo se consolid&oacute; la Web 3.0, centrada en el uso de datos y la personalizaci&oacute;n 
de contenidos, y comenz&oacute; el desarrollo de la Web 4.0, orientada a la automatizaci&oacute;n, la 
interacci&oacute;n en tiempo real y la integraci&oacute;n con dispositivos inteligentes.</p>

<div class="imagenes"> 
<img src="Multimedia/web3.png" alt="Web 3.0" width="250" height="200">
<img src="Multimedia/web4.png" alt="Web 4.0" width="250" height="200"> 
</div>

<p>Con el lanzamiento de HTML5, las p&aacute;ginas comenzaron a ofrecer experiencias m&aacute;s 
din&aacute;micas e interactivas, similares a aplicaciones m&oacute;viles. El dise&ntilde;o responsivo 
permiti&oacute; adaptar los sitios a distintos dispositivos, impulsando el uso masivo del internet m&oacute;vil.</p> 

<div class="imagenes"> 
<img src="Multimedia/ht5.png" alt="HTML5" width="300" height="200">
</div>


<p>La inteligencia artificial cobr&oacute; gran importancia mediante asistentes virtuales y sistemas 
capaces de analizar grandes vol&uacute;menes de informaci&oacute;n para ofrecer recomendaciones personalizadas. 
Asimismo, el Internet de las Cosas (IoT) conect&oacute; dispositivos como relojes inteligentes y hogares digitales.</p>
 
<div class="imagenes"> 
<img src="Multimedia/iot.jpeg" alt="IoT" width="300" height="200"> 
</div>
 
<p>Finalmente, el despliegue del 5G mejor&oacute; la velocidad y capacidad de conexi&oacute;n, 
fortaleciendo el avance hacia una Web 4.0 m&aacute;s predictiva, automatizada y conectada en tiempo real.</p>

</div>

</section>
  
<footer>
Copyright &copy; itorizaba.edu.mx
<a href="contacto.html" class="inicio">Contactanos</a>
</footer>
  
</div>

</body>

</html>
